import time

import pandas as pd
import numpy as np
import datetime as dt
from csv import writer
import pickle


def clean_pred(dirty_df):
    # get tlv rows
    dirty_df = dirty_df[dirty_df['linqmap_city'] == 'תל אביב - יפו'].copy()

    # remove unwanted cols
    cols_to_remove = ['OBJECTID', 'linqmap_reportDescription', 'linqmap_nearby', 'linqmap_reportMood',
                      'linqmap_expectedBeginDate', 'linqmap_expectedEndDate', 'nComments', 'linqmap_city', 'test_set']
    dirty_df.drop(columns=cols_to_remove, inplace=True)

    # fill nans
    dirty_df = dirty_df.bfill(axis=0).ffill(axis=0)

    # add NS & WE cols
    dirty_df['NS'] = np.where((dirty_df['linqmap_magvar'] < 90) | (dirty_df['linqmap_magvar'] > 270), 1, 0)
    dirty_df['EW'] = np.where((dirty_df['linqmap_magvar'] < 180), 1, 0)

    # convert date & time & timestamp to datetime object
    dirty_df['pubDate'] = dirty_df.apply(lambda row: dt.datetime.strptime(row.pubDate, "%m/%d/%Y %H:%M:%S"), axis=1)
    dirty_df['update_date'] = dirty_df.apply(lambda row: dt.datetime.fromtimestamp(row.update_date / 1000), axis=1)
    dirty_df['event_time_hours'] = dirty_df.apply(lambda row: (row.update_date - row.pubDate).total_seconds() / 3600,
                                                  axis=1)
    initial = dirty_df.shape[0]
    streets = ['המכבי', 'בן יהודה', 'לבונטין', 'לילינבלום', 'אייזיק רמבה', 'אליפלט', 'השומרון', 'רציף הרברט סמואל',
               'התערוכה',
               'דרך שלמה', 'העליה', 'יהודית', 'סלומון', 'יוסף לוי', 'הארבעה', 'הברזל', 'יצחק שדה', 'ארלוזורוב',
               'הגלבוע',
               'קפריסין', 'עליית הנוער', 'הגבורה', 'אד קוץ', 'חומה ומגדל', 'בני אפרים', 'פרופסור יחזקאל קויפמן',
               'יהודה מרגוזה', 'ריב"ל', 'החרש', 'מלכי ישראל', 'יצחק טבנקין', 'ח"ן', 'בוגרשוב', 'עודד', 'בלוך',
               'לוי אשכול',
               'ש"י עגנון', 'יצחק גרציאני', 'השוק', 'י.ל. גורדון', 'וילנא', 'שפ"ר', 'מזא"ה', 'שיקוע קרליבך',
               'שד קרן קיימת לישראל', 'היינריך היינה', 'צבי פרייגרזון', 'רוני', 'אבן גבירול', 'ירוחם משל', 'קלישר',
               'אלנבי',
               'רחל', 'הדר יוסף', 'יחזקאל', 'אהרון בקר', 'לאונרדו דה וינצי', 'דרך בגין', 'יפת', 'תובל', 'גבעון',
               'ברנדייס',
               'שבתאי דון יחיא', 'זלוציסטי', 'רמז', 'חיים לבנון', 'יוניצמן', 'אחד העם', 'פינס', 'הטייסים',
               'ארניה אוסוולדו',
               'הפרדס', 'מח"ל', 'שגב', 'שמחה בלאס', 'ישראל מסלנט', 'אליעזר פרי', 'רש"י', 'הנריטה סאלד', 'שארית ישראל',
               'לוחמי גליפולי', 'הכרמל', 'ראול ולנברג', 'שלבים', 'דוד רזיאל', 'יבנה', 'הרב ניסים', 'דפנה', 'בצלאל יפה',
               'לואי פסטר', 'שטרית (מנהרה)', 'יהודה הימית', 'מונטיפיורי', 'גבעת התחמושת', 'מנהרת מנחם בגין',
               'טרומפלדור',
               'בן סרוק', 'לח"י', 'ירמיהו', 'ויצמן', 'לה גווארדיה', 'לויד גורג', 'דבורה הנביאה', 'בצרון', 'ריינס',
               'דיזנגוף',
               'שינקין', 'שד רוקח', 'דרך יפו', 'מוהליבר', 'שד רוקח (גשר)', 'יד חרוצים', 'שד ירושלים', 'רא"ל יעקב דורי',
               'בית אשל', 'ציונה תגר', 'המלך גורג', '3780', 'העבודה', 'תל גיבורים', 'פנחס רוזן', 'שטראוס',
               'נחלת בנימין',
               'גרוזנברג', 'משמר הירדן', 'נחמה', 'יהושוע בן נון', 'יוחנן הסנדלר', 'שמריהו לוין', 'דרך חיל השריון',
               'זבוטינסקי', 'גשר יצחק מודעי', 'מוזס יהודה ונח', 'סירקין', 'פוריה', 'ברגסון', 'אילת', 'הגיבור האלמוני',
               'אוסישקין', 'סעדיה גאון', 'על פרשת דרכים', 'מאפו', 'נחלת יצחק', 'לבנדה', 'שטרית', 'יהודה הלוי',
               'משה סנה',
               'האומנים', 'מעפילי אגוז', 'יגאל אלון', 'רבנו חננאל', 'שניאור', 'אליעזר קפלן', 'ינון', 'הרב שלמה גורן',
               'נורדאו', 'פנחס ספיר', 'אברהם שלונסקי', 'הרצל', 'דרך השלום', 'הר ציון', 'לסקוב חיים', 'משה דיין',
               'עולי ציון',
               'קרית שאול', 'פנקס', 'פרישמן', 'וייס אייזיק הירש', 'בן צבי', 'דרך אריה (לובה) אליאב', 'מאנגר איציק',
               'החשמונאים', 'הוברמן', 'לוינסקי', 'שתולים', 'רקנאטי', 'טשרניחובסקי', 'הרכבת', 'קרליבך', 'צה"ל',
               'עמק ברכה', 'צבי פרופס', 'בני דן', 'בן גוריון', 'דרך נמיר', 'איסרליש', 'ה באייר', 'קוסובסקי', 'הורודצקי',
               'המלך כורש', '2040', 'רוטשילד', 'הכובשים', 'צלנוב', 'יד לבנים', '976', 'פנחס לבון', 'הרב הלר חיים',
               'המרד',
               'דם המכבים', 'ההגנה', 'שונצינו', 'ניצנה', 'ערבי נחל', 'רנ"ק', 'השחר', 'מרזוק ועזר', 'קהילת יאסי',
               'וינגייט',
               'מויאל אהרון', 'פינסקר', '1185', 'גואל', 'קלאוזנר', 'דרך חיים בר-לב', 'הירקון', 'בנימיני',
               'דרך קיבוץ גלויות', 'המסגר',
               'איינשטיין', 'ידידיה פרנקל', 'ברזילי', 'ביל"ו', 'נחום גולדמן', 'גלוסקא', 'המלאכה', 'שד שאול המלך',
               'קלצקין', 'לינקולן', 'הצפירה', 'יגיע כפיים', 'הרכב']
    dirty_df = dirty_df[['linqmap_street'] + [col for col in dirty_df.columns if col != 'linqmap_street']]
    for i in range(len(streets)):
        lst = [None] * (dirty_df.shape[1])
        lst[0] = streets[i]
        dirty_df.loc[dirty_df.shape[0]] = lst

    # add dummies for street
    dums = pd.get_dummies(dirty_df['linqmap_street'])
    dirty_df = pd.concat([dirty_df, dums], axis=1)
    dirty_df = dirty_df.iloc[:initial, :].copy()

    initial2 = dirty_df.shape[0]
    subtypes = ['JAM_MODERATE_TRAFFIC', 'HAZARD_ON_ROAD_TRAFFIC_LIGHT_FAULT', 'HAZARD_ON_ROAD', 'ROAD_CLOSED_EVENT',
                'ACCIDENT_MAJOR', 'ROAD_CLOSED_CONSTRUCTION', 'HAZARD_ON_SHOULDER_CAR_STOPPED', 'JAM_HEAVY_TRAFFIC',
                'HAZARD_ON_ROAD_POT_HOLE', 'HAZARD_ON_ROAD_OBJECT', 'JAM_STAND_STILL_TRAFFIC', 'ACCIDENT_MINOR',
                'HAZARD_ON_ROAD_CAR_STOPPED', 'HAZARD_ON_ROAD_CONSTRUCTION']
    dirty_df = dirty_df[['linqmap_subtype'] + [col for col in dirty_df.columns if col != 'linqmap_subtype']]

    for i in range(len(subtypes)):
        lst = [None] * (dirty_df.shape[1])
        lst[0] = subtypes[i]
        dirty_df.loc[dirty_df.shape[0]] = lst

    # add dummies for subtype
    dums = pd.get_dummies(dirty_df['linqmap_subtype'])
    dirty_df = pd.concat([dirty_df, dums], axis=1)
    dirty_df = dirty_df.iloc[:initial2, :].copy()

    # create saved df file of types and subtype
    subtypes = dirty_df.groupby('linqmap_type').aggregate({'linqmap_subtype': np.unique})
    subtypes.to_csv('subtypes.csv')

    # remove magvar & pubdate & street colb
    dirty_df.drop(columns=['linqmap_magvar', 'pubDate', 'linqmap_street', 'update_date', 'linqmap_type'], inplace=True)

    dirty_df = pd.concat([dirty_df, dums], axis=1)
    return dirty_df


def get_comb_for_pred(df):
    new_cols = []
    for i in range(1, 5):
        new_cols += list(df.columns.astype(str) + '_S' + str(i))

    with open('to_predict.csv', 'w') as f_object:
        writer_object = writer(f_object)
        writer_object.writerow(new_cols)
        for i in range(0, df.shape[0] - 4, 4):
            print('\r', str(round(i / (df.shape[0] - 4) * 100, 2)) + ' %', end='')
            cur_row = []
            cur_row += list(df.iloc[i, :])
            cur_row += list(df.iloc[i + 1, :])
            cur_row += list(df.iloc[i + 2, :])
            cur_row += list(df.iloc[i + 3, :])
            writer_object.writerow(cur_row)
        print('\r100 %')
    f_object.close()
    temp = pd.read_csv('to_predict.csv')

    temp.drop(columns=['linqmap_subtype_S1', 'linqmap_subtype_S2', 'linqmap_subtype_S3', 'linqmap_subtype_S4'],
              inplace=True)
    temp.dropna(axis=0, inplace=True)
    temp = temp.reindex(sorted(temp.columns), axis=1)
    return temp


def run_1(data_path):
    df_cleaned = clean_pred(pd.read_csv(data_path))
    df = get_comb_for_pred(df_cleaned)

    loaded_model_knn = pickle.load(open('finalized_knn_model.sav', 'rb'))
    loaded_model_reg_x = pickle.load(open('finalized_reg_x_model.sav', 'rb'))
    loaded_model_reg_y = pickle.load(open('finalized_reg_y_model.sav', 'rb'))

    to_remove = list(set(df.columns) - set(['1185_S1', '1185_S2', '1185_S3', '1185_S4', '2040_S1', '2040_S2', '2040_S3', '2040_S4', '3780_S1', '3780_S2',
         '3780_S3', '3780_S4', '976_S1', '976_S2', '976_S3', '976_S4', 'ACCIDENT_MAJOR_S1', 'ACCIDENT_MAJOR_S2',
         'ACCIDENT_MAJOR_S3', 'ACCIDENT_MAJOR_S4', 'ACCIDENT_MINOR_S1', 'ACCIDENT_MINOR_S2', 'ACCIDENT_MINOR_S3',
         'ACCIDENT_MINOR_S4', 'EW_S1', 'EW_S2', 'EW_S3', 'EW_S4', 'HAZARD_ON_ROAD_CAR_STOPPED_S1',
         'HAZARD_ON_ROAD_CAR_STOPPED_S2', 'HAZARD_ON_ROAD_CAR_STOPPED_S3', 'HAZARD_ON_ROAD_CAR_STOPPED_S4',
         'HAZARD_ON_ROAD_CONSTRUCTION_S1', 'HAZARD_ON_ROAD_CONSTRUCTION_S2', 'HAZARD_ON_ROAD_CONSTRUCTION_S3',
         'HAZARD_ON_ROAD_CONSTRUCTION_S4', 'HAZARD_ON_ROAD_OBJECT_S1', 'HAZARD_ON_ROAD_OBJECT_S2',
         'HAZARD_ON_ROAD_OBJECT_S3', 'HAZARD_ON_ROAD_OBJECT_S4', 'HAZARD_ON_ROAD_POT_HOLE_S1',
         'HAZARD_ON_ROAD_POT_HOLE_S2', 'HAZARD_ON_ROAD_POT_HOLE_S3', 'HAZARD_ON_ROAD_POT_HOLE_S4', 'HAZARD_ON_ROAD_S1',
         'HAZARD_ON_ROAD_S2', 'HAZARD_ON_ROAD_S3', 'HAZARD_ON_ROAD_S4', 'HAZARD_ON_ROAD_TRAFFIC_LIGHT_FAULT_S1',
         'HAZARD_ON_ROAD_TRAFFIC_LIGHT_FAULT_S2', 'HAZARD_ON_ROAD_TRAFFIC_LIGHT_FAULT_S3',
         'HAZARD_ON_ROAD_TRAFFIC_LIGHT_FAULT_S4', 'HAZARD_ON_SHOULDER_CAR_STOPPED_S1',
         'HAZARD_ON_SHOULDER_CAR_STOPPED_S2', 'HAZARD_ON_SHOULDER_CAR_STOPPED_S3', 'HAZARD_ON_SHOULDER_CAR_STOPPED_S4',
         'JAM_HEAVY_TRAFFIC_S1', 'JAM_HEAVY_TRAFFIC_S2', 'JAM_HEAVY_TRAFFIC_S3', 'JAM_HEAVY_TRAFFIC_S4',
         'JAM_MODERATE_TRAFFIC_S1', 'JAM_MODERATE_TRAFFIC_S2', 'JAM_MODERATE_TRAFFIC_S3', 'JAM_MODERATE_TRAFFIC_S4',
         'JAM_STAND_STILL_TRAFFIC_S1', 'JAM_STAND_STILL_TRAFFIC_S2', 'JAM_STAND_STILL_TRAFFIC_S3',
         'JAM_STAND_STILL_TRAFFIC_S4', 'NS_S1', 'NS_S2', 'NS_S3', 'NS_S4', 'ROAD_CLOSED_CONSTRUCTION_S1',
         'ROAD_CLOSED_CONSTRUCTION_S2', 'ROAD_CLOSED_CONSTRUCTION_S3', 'ROAD_CLOSED_CONSTRUCTION_S4',
         'ROAD_CLOSED_EVENT_S1', 'ROAD_CLOSED_EVENT_S2', 'ROAD_CLOSED_EVENT_S3', 'ROAD_CLOSED_EVENT_S4',
         'event_time_hours_S1', 'event_time_hours_S2', 'event_time_hours_S3', 'event_time_hours_S4',
         'linqmap_reliability_S1', 'linqmap_reliability_S2', 'linqmap_reliability_S3', 'linqmap_reliability_S4',
         'linqmap_reportRating_S1', 'linqmap_reportRating_S2', 'linqmap_reportRating_S3', 'linqmap_reportRating_S4',
         'linqmap_roadType_S1', 'linqmap_roadType_S2', 'linqmap_roadType_S3', 'linqmap_roadType_S4', 'אבן גבירול_S1',
         'אבן גבירול_S2', 'אבן גבירול_S3', 'אבן גבירול_S4', 'אברהם שלונסקי_S1', 'אברהם שלונסקי_S2', 'אברהם שלונסקי_S3',
         'אברהם שלונסקי_S4', 'אד קוץ_S1', 'אד קוץ_S2', 'אד קוץ_S3', 'אד קוץ_S4', 'אהרון בקר_S1', 'אהרון בקר_S2',
         'אהרון בקר_S3', 'אהרון בקר_S4', 'אוסישקין_S1', 'אוסישקין_S2', 'אוסישקין_S3', 'אוסישקין_S4', 'אחד העם_S1',
         'אחד העם_S2', 'אחד העם_S3', 'אחד העם_S4', 'אייזיק רמבה_S1', 'אייזיק רמבה_S2', 'אייזיק רמבה_S3',
         'אייזיק רמבה_S4', 'איינשטיין_S1', 'איינשטיין_S2', 'איינשטיין_S3', 'איינשטיין_S4', 'אילת_S1', 'אילת_S2',
         'אילת_S3', 'אילת_S4', 'איסרליש_S1', 'איסרליש_S2', 'איסרליש_S3', 'איסרליש_S4', 'אליעזר פרי_S1', 'אליעזר פרי_S2',
         'אליעזר פרי_S3', 'אליעזר פרי_S4', 'אליעזר קפלן_S1', 'אליעזר קפלן_S2', 'אליעזר קפלן_S3', 'אליעזר קפלן_S4',
         'אליפלט_S1', 'אליפלט_S2', 'אליפלט_S3', 'אליפלט_S4', 'אלנבי_S1', 'אלנבי_S2', 'אלנבי_S3', 'אלנבי_S4',
         'ארלוזורוב_S1', 'ארלוזורוב_S2', 'ארלוזורוב_S3', 'ארלוזורוב_S4', 'ארניה אוסוולדו_S1', 'ארניה אוסוולדו_S2',
         'ארניה אוסוולדו_S3', 'ארניה אוסוולדו_S4', 'בוגרשוב_S1', 'בוגרשוב_S2', 'בוגרשוב_S3', 'בוגרשוב_S4', 'ביל"ו_S1',
         'ביל"ו_S2', 'ביל"ו_S3', 'ביל"ו_S4', 'בית אשל_S1', 'בית אשל_S2', 'בית אשל_S3', 'בית אשל_S4', 'בלוך_S1',
         'בלוך_S2', 'בלוך_S3', 'בלוך_S4', 'בן גוריון_S1', 'בן גוריון_S2', 'בן גוריון_S3', 'בן גוריון_S4', 'בן יהודה_S1',
         'בן יהודה_S2', 'בן יהודה_S3', 'בן יהודה_S4', 'בן סרוק_S1', 'בן סרוק_S2', 'בן סרוק_S3', 'בן סרוק_S4',
         'בן צבי_S1', 'בן צבי_S2', 'בן צבי_S3', 'בן צבי_S4', 'בני אפרים_S1', 'בני אפרים_S2', 'בני אפרים_S3',
         'בני אפרים_S4', 'בני דן_S1', 'בני דן_S2', 'בני דן_S3', 'בני דן_S4', 'בנימיני_S1', 'בנימיני_S2', 'בנימיני_S3',
         'בנימיני_S4', 'בצלאל יפה_S1', 'בצלאל יפה_S2', 'בצלאל יפה_S3', 'בצלאל יפה_S4', 'בצרון_S1', 'בצרון_S2',
         'בצרון_S3', 'בצרון_S4', 'ברגסון_S1', 'ברגסון_S2', 'ברגסון_S3', 'ברגסון_S4', 'ברזילי_S1', 'ברזילי_S2',
         'ברזילי_S3', 'ברזילי_S4', 'ברנדייס_S1', 'ברנדייס_S2', 'ברנדייס_S3', 'ברנדייס_S4', 'גבעון_S1', 'גבעון_S2',
         'גבעון_S3', 'גבעון_S4', 'גבעת התחמושת_S1', 'גבעת התחמושת_S2', 'גבעת התחמושת_S3', 'גבעת התחמושת_S4', 'גואל_S1',
         'גואל_S2', 'גואל_S3', 'גואל_S4', 'גלוסקא_S1', 'גלוסקא_S2', 'גלוסקא_S3', 'גלוסקא_S4', 'גרוזנברג_S1',
         'גרוזנברג_S2', 'גרוזנברג_S3', 'גרוזנברג_S4', 'גשר יצחק מודעי_S1', 'גשר יצחק מודעי_S2', 'גשר יצחק מודעי_S3',
         'גשר יצחק מודעי_S4', 'דבורה הנביאה_S1', 'דבורה הנביאה_S2', 'דבורה הנביאה_S3', 'דבורה הנביאה_S4',
         'דוד רזיאל_S1', 'דוד רזיאל_S2', 'דוד רזיאל_S3', 'דוד רזיאל_S4', 'דיזנגוף_S1', 'דיזנגוף_S2', 'דיזנגוף_S3',
         'דיזנגוף_S4', 'דם המכבים_S1', 'דם המכבים_S2', 'דם המכבים_S3', 'דם המכבים_S4', 'דפנה_S1', 'דפנה_S2', 'דפנה_S3',
         'דפנה_S4', 'דרך אריה (לובה) אליאב_S1', 'דרך אריה (לובה) אליאב_S2', 'דרך אריה (לובה) אליאב_S3',
         'דרך אריה (לובה) אליאב_S4', 'דרך בגין_S1', 'דרך בגין_S2', 'דרך בגין_S3', 'דרך בגין_S4', 'דרך השלום_S1',
         'דרך השלום_S2', 'דרך השלום_S3', 'דרך השלום_S4', 'דרך חיים בר-לב_S1', 'דרך חיים בר-לב_S2', 'דרך חיים בר-לב_S3',
         'דרך חיים בר-לב_S4', 'דרך חיל השריון_S1', 'דרך חיל השריון_S2', 'דרך חיל השריון_S3', 'דרך חיל השריון_S4',
         'דרך יפו_S1', 'דרך יפו_S2', 'דרך יפו_S3', 'דרך יפו_S4', 'דרך נמיר_S1', 'דרך נמיר_S2', 'דרך נמיר_S3',
         'דרך נמיר_S4', 'דרך קיבוץ גלויות_S1', 'דרך קיבוץ גלויות_S2', 'דרך קיבוץ גלויות_S3', 'דרך קיבוץ גלויות_S4',
         'דרך שלמה_S1', 'דרך שלמה_S2', 'דרך שלמה_S3', 'דרך שלמה_S4', 'ה באייר_S1', 'ה באייר_S2', 'ה באייר_S3',
         'ה באייר_S4', 'האומנים_S1', 'האומנים_S2', 'האומנים_S3', 'האומנים_S4', 'הארבעה_S1', 'הארבעה_S2', 'הארבעה_S3',
         'הארבעה_S4', 'הברזל_S1', 'הברזל_S2', 'הברזל_S3', 'הברזל_S4', 'הגבורה_S1', 'הגבורה_S2', 'הגבורה_S3',
         'הגבורה_S4', 'הגיבור האלמוני_S1', 'הגיבור האלמוני_S2', 'הגיבור האלמוני_S3', 'הגיבור האלמוני_S4', 'הגלבוע_S1',
         'הגלבוע_S2', 'הגלבוע_S3', 'הגלבוע_S4', 'הדר יוסף_S1', 'הדר יוסף_S2', 'הדר יוסף_S3', 'הדר יוסף_S4', 'ההגנה_S1',
         'ההגנה_S2', 'ההגנה_S3', 'ההגנה_S4', 'הוברמן_S1', 'הוברמן_S2', 'הוברמן_S3', 'הוברמן_S4', 'הורודצקי_S1',
         'הורודצקי_S2', 'הורודצקי_S3', 'הורודצקי_S4', 'החרש_S1', 'החרש_S2', 'החרש_S3', 'החרש_S4', 'החשמונאים_S1',
         'החשמונאים_S2', 'החשמונאים_S3', 'החשמונאים_S4', 'הטייסים_S1', 'הטייסים_S2', 'הטייסים_S3', 'הטייסים_S4',
         'היינריך היינה_S1', 'היינריך היינה_S2', 'היינריך היינה_S3', 'היינריך היינה_S4', 'הירקון_S1', 'הירקון_S2',
         'הירקון_S3', 'הירקון_S4', 'הכובשים_S1', 'הכובשים_S2', 'הכובשים_S3', 'הכובשים_S4', 'הכרמל_S1', 'הכרמל_S2',
         'הכרמל_S3', 'הכרמל_S4', 'המכבי_S1', 'המכבי_S2', 'המכבי_S3', 'המכבי_S4', 'המלאכה_S1', 'המלאכה_S2', 'המלאכה_S3',
         'המלאכה_S4', 'המלך גורג_S1', 'המלך גורג_S2', 'המלך גורג_S3', 'המלך גורג_S4', 'המלך כורש_S1', 'המלך כורש_S2',
         'המלך כורש_S3', 'המלך כורש_S4', 'המסגר_S1', 'המסגר_S2', 'המסגר_S3', 'המסגר_S4', 'המרד_S1', 'המרד_S2',
         'המרד_S3', 'המרד_S4', 'הנריטה סאלד_S1', 'הנריטה סאלד_S2', 'הנריטה סאלד_S3', 'הנריטה סאלד_S4', 'העבודה_S1',
         'העבודה_S2', 'העבודה_S3', 'העבודה_S4', 'העליה_S1', 'העליה_S2', 'העליה_S3', 'העליה_S4', 'הפרדס_S1', 'הפרדס_S2',
         'הפרדס_S3', 'הפרדס_S4', 'הצפירה_S1', 'הצפירה_S2', 'הצפירה_S3', 'הצפירה_S4', 'הר ציון_S1', 'הר ציון_S2',
         'הר ציון_S3', 'הר ציון_S4', 'הרב הלר חיים_S1', 'הרב הלר חיים_S2', 'הרב הלר חיים_S3', 'הרב הלר חיים_S4',
         'הרב ניסים_S1', 'הרב ניסים_S2', 'הרב ניסים_S3', 'הרב ניסים_S4', 'הרב שלמה גורן_S1', 'הרב שלמה גורן_S2',
         'הרב שלמה גורן_S3', 'הרב שלמה גורן_S4', 'הרכב_S1', 'הרכב_S2', 'הרכב_S3', 'הרכב_S4', 'הרכבת_S1', 'הרכבת_S2',
         'הרכבת_S3', 'הרכבת_S4', 'הרצל_S1', 'הרצל_S2', 'הרצל_S3', 'הרצל_S4', 'השומרון_S1', 'השומרון_S2', 'השומרון_S3',
         'השומרון_S4', 'השוק_S1', 'השוק_S2', 'השוק_S3', 'השוק_S4', 'השחר_S1', 'השחר_S2', 'השחר_S3', 'השחר_S4',
         'התערוכה_S1', 'התערוכה_S2', 'התערוכה_S3', 'התערוכה_S4', 'וייס אייזיק הירש_S1', 'וייס אייזיק הירש_S2',
         'וייס אייזיק הירש_S3', 'וייס אייזיק הירש_S4', 'וילנא_S1', 'וילנא_S2', 'וילנא_S3', 'וילנא_S4', 'וינגייט_S1',
         'וינגייט_S2', 'וינגייט_S3', 'וינגייט_S4', 'ויצמן_S1', 'ויצמן_S2', 'ויצמן_S3', 'ויצמן_S4', 'זבוטינסקי_S1',
         'זבוטינסקי_S2', 'זבוטינסקי_S3', 'זבוטינסקי_S4', 'זלוציסטי_S1', 'זלוציסטי_S2', 'זלוציסטי_S3', 'זלוציסטי_S4',
         'ח"ן_S1', 'ח"ן_S2', 'ח"ן_S3', 'ח"ן_S4', 'חומה ומגדל_S1', 'חומה ומגדל_S2', 'חומה ומגדל_S3', 'חומה ומגדל_S4',
         'חיים לבנון_S1', 'חיים לבנון_S2', 'חיים לבנון_S3', 'חיים לבנון_S4', 'טרומפלדור_S1', 'טרומפלדור_S2',
         'טרומפלדור_S3', 'טרומפלדור_S4', 'טשרניחובסקי_S1', 'טשרניחובסקי_S2', 'טשרניחובסקי_S3', 'טשרניחובסקי_S4',
         'י.ל. גורדון_S1', 'י.ל. גורדון_S2', 'י.ל. גורדון_S3', 'י.ל. גורדון_S4', 'יבנה_S1', 'יבנה_S2', 'יבנה_S3',
         'יבנה_S4', 'יגאל אלון_S1', 'יגאל אלון_S2', 'יגאל אלון_S3', 'יגאל אלון_S4', 'יגיע כפיים_S1', 'יגיע כפיים_S2',
         'יגיע כפיים_S3', 'יגיע כפיים_S4', 'יד חרוצים_S1', 'יד חרוצים_S2', 'יד חרוצים_S3', 'יד חרוצים_S4',
         'יד לבנים_S1', 'יד לבנים_S2', 'יד לבנים_S3', 'יד לבנים_S4', 'ידידיה פרנקל_S1', 'ידידיה פרנקל_S2',
         'ידידיה פרנקל_S3', 'ידידיה פרנקל_S4', 'יהודה הימית_S1', 'יהודה הימית_S2', 'יהודה הימית_S3', 'יהודה הימית_S4',
         'יהודה הלוי_S1', 'יהודה הלוי_S2', 'יהודה הלוי_S3', 'יהודה הלוי_S4', 'יהודה מרגוזה_S1', 'יהודה מרגוזה_S2',
         'יהודה מרגוזה_S3', 'יהודה מרגוזה_S4', 'יהודית_S1', 'יהודית_S2', 'יהודית_S3', 'יהודית_S4', 'יהושוע בן נון_S1',
         'יהושוע בן נון_S2', 'יהושוע בן נון_S3', 'יהושוע בן נון_S4', 'יוחנן הסנדלר_S1', 'יוחנן הסנדלר_S2',
         'יוחנן הסנדלר_S3', 'יוחנן הסנדלר_S4', 'יוניצמן_S1', 'יוניצמן_S2', 'יוניצמן_S3', 'יוניצמן_S4', 'יוסף לוי_S1',
         'יוסף לוי_S2', 'יוסף לוי_S3', 'יוסף לוי_S4', 'יחזקאל_S1', 'יחזקאל_S2', 'יחזקאל_S3', 'יחזקאל_S4', 'ינון_S1',
         'ינון_S2', 'ינון_S3', 'ינון_S4', 'יפת_S1', 'יפת_S2', 'יפת_S3', 'יפת_S4', 'יצחק גרציאני_S1', 'יצחק גרציאני_S2',
         'יצחק גרציאני_S3', 'יצחק גרציאני_S4', 'יצחק טבנקין_S1', 'יצחק טבנקין_S2', 'יצחק טבנקין_S3', 'יצחק טבנקין_S4',
         'יצחק שדה_S1', 'יצחק שדה_S2', 'יצחק שדה_S3', 'יצחק שדה_S4', 'ירוחם משל_S1', 'ירוחם משל_S2', 'ירוחם משל_S3',
         'ירוחם משל_S4', 'ירמיהו_S1', 'ירמיהו_S2', 'ירמיהו_S3', 'ירמיהו_S4', 'ישראל מסלנט_S1', 'ישראל מסלנט_S2',
         'ישראל מסלנט_S3', 'ישראל מסלנט_S4', 'לאונרדו דה וינצי_S1', 'לאונרדו דה וינצי_S2', 'לאונרדו דה וינצי_S3',
         'לאונרדו דה וינצי_S4', 'לבונטין_S1', 'לבונטין_S2', 'לבונטין_S3', 'לבונטין_S4', 'לבנדה_S1', 'לבנדה_S2',
         'לבנדה_S3', 'לבנדה_S4', 'לה גווארדיה_S1', 'לה גווארדיה_S2', 'לה גווארדיה_S3', 'לה גווארדיה_S4', 'לואי פסטר_S1',
         'לואי פסטר_S2', 'לואי פסטר_S3', 'לואי פסטר_S4', 'לוחמי גליפולי_S1', 'לוחמי גליפולי_S2', 'לוחמי גליפולי_S3',
         'לוחמי גליפולי_S4', 'לוי אשכול_S1', 'לוי אשכול_S2', 'לוי אשכול_S3', 'לוי אשכול_S4', 'לויד גורג_S1',
         'לויד גורג_S2', 'לויד גורג_S3', 'לויד גורג_S4', 'לוינסקי_S1', 'לוינסקי_S2', 'לוינסקי_S3', 'לוינסקי_S4',
         'לח"י_S1', 'לח"י_S2', 'לח"י_S3', 'לח"י_S4', 'לילינבלום_S1', 'לילינבלום_S2', 'לילינבלום_S3', 'לילינבלום_S4',
         'לינקולן_S1', 'לינקולן_S2', 'לינקולן_S3', 'לינקולן_S4', 'לסקוב חיים_S1', 'לסקוב חיים_S2', 'לסקוב חיים_S3',
         'לסקוב חיים_S4', 'מאנגר איציק_S1', 'מאנגר איציק_S2', 'מאנגר איציק_S3', 'מאנגר איציק_S4', 'מאפו_S1', 'מאפו_S2',
         'מאפו_S3', 'מאפו_S4', 'מוהליבר_S1', 'מוהליבר_S2', 'מוהליבר_S3', 'מוהליבר_S4', 'מוזס יהודה ונח_S1',
         'מוזס יהודה ונח_S2', 'מוזס יהודה ונח_S3', 'מוזס יהודה ונח_S4', 'מויאל אהרון_S1', 'מויאל אהרון_S2',
         'מויאל אהרון_S3', 'מויאל אהרון_S4', 'מונטיפיורי_S1', 'מונטיפיורי_S2', 'מונטיפיורי_S3', 'מונטיפיורי_S4',
         'מזא"ה_S1', 'מזא"ה_S2', 'מזא"ה_S3', 'מזא"ה_S4', 'מח"ל_S1', 'מח"ל_S2', 'מח"ל_S3', 'מח"ל_S4', 'מלכי ישראל_S1',
         'מלכי ישראל_S2', 'מלכי ישראל_S3', 'מלכי ישראל_S4', 'מנהרת מנחם בגין_S1', 'מנהרת מנחם בגין_S2',
         'מנהרת מנחם בגין_S3', 'מנהרת מנחם בגין_S4', 'מעפילי אגוז_S1', 'מעפילי אגוז_S2', 'מעפילי אגוז_S3',
         'מעפילי אגוז_S4', 'מרזוק ועזר_S1', 'מרזוק ועזר_S2', 'מרזוק ועזר_S3', 'מרזוק ועזר_S4', 'משה דיין_S1',
         'משה דיין_S2', 'משה דיין_S3', 'משה דיין_S4', 'משה סנה_S1', 'משה סנה_S2', 'משה סנה_S3', 'משה סנה_S4',
         'משמר הירדן_S1', 'משמר הירדן_S2', 'משמר הירדן_S3', 'משמר הירדן_S4', 'נורדאו_S1', 'נורדאו_S2', 'נורדאו_S3',
         'נורדאו_S4', 'נחום גולדמן_S1', 'נחום גולדמן_S2', 'נחום גולדמן_S3', 'נחום גולדמן_S4', 'נחלת בנימין_S1',
         'נחלת בנימין_S2', 'נחלת בנימין_S3', 'נחלת בנימין_S4', 'נחלת יצחק_S1', 'נחלת יצחק_S2', 'נחלת יצחק_S3',
         'נחלת יצחק_S4', 'נחמה_S1', 'נחמה_S2', 'נחמה_S3', 'נחמה_S4', 'ניצנה_S1', 'ניצנה_S2', 'ניצנה_S3', 'ניצנה_S4',
         'סירקין_S1', 'סירקין_S2', 'סירקין_S3', 'סירקין_S4', 'סלומון_S1', 'סלומון_S2', 'סלומון_S3', 'סלומון_S4',
         'סעדיה גאון_S1', 'סעדיה גאון_S2', 'סעדיה גאון_S3', 'סעדיה גאון_S4', 'עודד_S1', 'עודד_S2', 'עודד_S3', 'עודד_S4',
         'עולי ציון_S1', 'עולי ציון_S2', 'עולי ציון_S3', 'עולי ציון_S4', 'על פרשת דרכים_S1', 'על פרשת דרכים_S2',
         'על פרשת דרכים_S3', 'על פרשת דרכים_S4', 'עליית הנוער_S1', 'עליית הנוער_S2', 'עליית הנוער_S3', 'עליית הנוער_S4',
         'עמק ברכה_S1', 'עמק ברכה_S2', 'עמק ברכה_S3', 'עמק ברכה_S4', 'ערבי נחל_S1', 'ערבי נחל_S2', 'ערבי נחל_S3',
         'ערבי נחל_S4', 'פוריה_S1', 'פוריה_S2', 'פוריה_S3', 'פוריה_S4', 'פינס_S1', 'פינס_S2', 'פינס_S3', 'פינס_S4',
         'פינסקר_S1', 'פינסקר_S2', 'פינסקר_S3', 'פינסקר_S4', 'פנחס לבון_S1', 'פנחס לבון_S2', 'פנחס לבון_S3',
         'פנחס לבון_S4', 'פנחס ספיר_S1', 'פנחס ספיר_S2', 'פנחס ספיר_S3', 'פנחס ספיר_S4', 'פנחס רוזן_S1', 'פנחס רוזן_S2',
         'פנחס רוזן_S3', 'פנחס רוזן_S4', 'פנקס_S1', 'פנקס_S2', 'פנקס_S3', 'פנקס_S4', 'פרופסור יחזקאל קויפמן_S1',
         'פרופסור יחזקאל קויפמן_S2', 'פרופסור יחזקאל קויפמן_S3', 'פרופסור יחזקאל קויפמן_S4', 'פרישמן_S1', 'פרישמן_S2',
         'פרישמן_S3', 'פרישמן_S4', 'צבי פרופס_S1', 'צבי פרופס_S2', 'צבי פרופס_S3', 'צבי פרופס_S4', 'צבי פרייגרזון_S1',
         'צבי פרייגרזון_S2', 'צבי פרייגרזון_S3', 'צבי פרייגרזון_S4', 'צה"ל_S1', 'צה"ל_S2', 'צה"ל_S3', 'צה"ל_S4',
         'ציונה תגר_S1', 'ציונה תגר_S2', 'ציונה תגר_S3', 'ציונה תגר_S4', 'צלנוב_S1', 'צלנוב_S2', 'צלנוב_S3', 'צלנוב_S4',
         'קהילת יאסי_S1', 'קהילת יאסי_S2', 'קהילת יאסי_S3', 'קהילת יאסי_S4', 'קוסובסקי_S1', 'קוסובסקי_S2',
         'קוסובסקי_S3', 'קוסובסקי_S4', 'קלאוזנר_S1', 'קלאוזנר_S2', 'קלאוזנר_S3', 'קלאוזנר_S4', 'קלישר_S1', 'קלישר_S2',
         'קלישר_S3', 'קלישר_S4', 'קלצקין_S1', 'קלצקין_S2', 'קלצקין_S3', 'קלצקין_S4', 'קפריסין_S1', 'קפריסין_S2',
         'קפריסין_S3', 'קפריסין_S4', 'קרית שאול_S1', 'קרית שאול_S2', 'קרית שאול_S3', 'קרית שאול_S4', 'קרליבך_S1',
         'קרליבך_S2', 'קרליבך_S3', 'קרליבך_S4', 'רא"ל יעקב דורי_S1', 'רא"ל יעקב דורי_S2', 'רא"ל יעקב דורי_S3',
         'רא"ל יעקב דורי_S4', 'ראול ולנברג_S1', 'ראול ולנברג_S2', 'ראול ולנברג_S3', 'ראול ולנברג_S4', 'רבנו חננאל_S1',
         'רבנו חננאל_S2', 'רבנו חננאל_S3', 'רבנו חננאל_S4', 'רוטשילד_S1', 'רוטשילד_S2', 'רוטשילד_S3', 'רוטשילד_S4',
         'רוני_S1', 'רוני_S2', 'רוני_S3', 'רוני_S4', 'רחל_S1', 'רחל_S2', 'רחל_S3', 'רחל_S4', 'ריב"ל_S1', 'ריב"ל_S2',
         'ריב"ל_S3', 'ריב"ל_S4', 'ריינס_S1', 'ריינס_S2', 'ריינס_S3', 'ריינס_S4', 'רמז_S1', 'רמז_S2', 'רמז_S3', 'רמז_S4',
         'רנ"ק_S1', 'רנ"ק_S2', 'רנ"ק_S3', 'רנ"ק_S4', 'רציף הרברט סמואל_S1', 'רציף הרברט סמואל_S2',
         'רציף הרברט סמואל_S3', 'רציף הרברט סמואל_S4', 'רקנאטי_S1', 'רקנאטי_S2', 'רקנאטי_S3', 'רקנאטי_S4', 'רש"י_S1',
         'רש"י_S2', 'רש"י_S3', 'רש"י_S4', 'ש"י עגנון_S1', 'ש"י עגנון_S2', 'ש"י עגנון_S3', 'ש"י עגנון_S4',
         'שארית ישראל_S1', 'שארית ישראל_S2', 'שארית ישראל_S3', 'שארית ישראל_S4', 'שבתאי דון יחיא_S1',
         'שבתאי דון יחיא_S2', 'שבתאי דון יחיא_S3', 'שבתאי דון יחיא_S4', 'שגב_S1', 'שגב_S2', 'שגב_S3', 'שגב_S4',
         'שד ירושלים_S1', 'שד ירושלים_S2', 'שד ירושלים_S3', 'שד ירושלים_S4', 'שד קרן קיימת לישראל_S1',
         'שד קרן קיימת לישראל_S2', 'שד קרן קיימת לישראל_S3', 'שד קרן קיימת לישראל_S4', 'שד רוקח (גשר)_S1',
         'שד רוקח (גשר)_S2', 'שד רוקח (גשר)_S3', 'שד רוקח (גשר)_S4', 'שד רוקח_S1', 'שד רוקח_S2', 'שד רוקח_S3',
         'שד רוקח_S4', 'שד שאול המלך_S1', 'שד שאול המלך_S2', 'שד שאול המלך_S3', 'שד שאול המלך_S4', 'שונצינו_S1',
         'שונצינו_S2', 'שונצינו_S3', 'שונצינו_S4', 'שטראוס_S1', 'שטראוס_S2', 'שטראוס_S3', 'שטראוס_S4',
         'שטרית (מנהרה)_S1', 'שטרית (מנהרה)_S2', 'שטרית (מנהרה)_S3', 'שטרית (מנהרה)_S4', 'שטרית_S1', 'שטרית_S2',
         'שטרית_S3', 'שטרית_S4', 'שינקין_S1', 'שינקין_S2', 'שינקין_S3', 'שינקין_S4', 'שיקוע קרליבך_S1',
         'שיקוע קרליבך_S2', 'שיקוע קרליבך_S3', 'שיקוע קרליבך_S4', 'שלבים_S1', 'שלבים_S2', 'שלבים_S3', 'שלבים_S4',
         'שמחה בלאס_S1', 'שמחה בלאס_S2', 'שמחה בלאס_S3', 'שמחה בלאס_S4', 'שמריהו לוין_S1', 'שמריהו לוין_S2',
         'שמריהו לוין_S3', 'שמריהו לוין_S4', 'שניאור_S1', 'שניאור_S2', 'שניאור_S3', 'שניאור_S4', 'שפ"ר_S1', 'שפ"ר_S2',
         'שפ"ר_S3', 'שפ"ר_S4', 'שתולים_S1', 'שתולים_S2', 'שתולים_S3', 'שתולים_S4', 'תובל_S1', 'תובל_S2', 'תובל_S3',
         'תובל_S4', 'תל גיבורים_S1', 'תל גיבורים_S2', 'תל גיבורים_S3', 'תל גיבורים_S4']))
    to_remove.remove('x_S1')
    to_remove.remove('x_S2')
    to_remove.remove('x_S3')
    to_remove.remove('x_S4')
    to_remove.remove('y_S1')
    to_remove.remove('y_S2')
    to_remove.remove('y_S3')
    to_remove.remove('y_S4')

    df.drop(columns=to_remove, inplace=True)

    reg_x_pred = loaded_model_reg_x.predict(df)
    reg_y_pred = loaded_model_reg_y.predict(df)
    knn_pred = loaded_model_knn.predict(df)

    '''
    add here a function that will make all the predictions in a table with mapping back to origional subtypes...
    then write
    '''

    # .to_csv('predictions_task_1.csv')
    return
